app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---

    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>