app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "slug", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Jan 2015 00:59:22 UTC +00:00], ["name", "crazy kids !!!!!!"], ["slug", "crazy-kids-"], ["updated_at", Mon, 12 Jan 2015 00:59:22 UTC +00:00]]