app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @post = Post.find(params[:post_id])
    #@comment = @post.comments.build(comment_params)
    @comment.creator = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1