app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 17]]
INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "Did it work?"], ["created_at", Sun, 28 Dec 2014 22:24:36 UTC +00:00], ["updated_at", Sun, 28 Dec 2014 22:24:36 UTC +00:00], ["user_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    @post = Post.find(params[:post_id])
    #@comment = @post.comments.build(comment_params)
    @comment.creator = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 04 Jan 2015 18:12:29 UTC +00:00], ["updated_at", Sun, 04 Jan 2015 18:12:29 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])