app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.sort_by{|x| x.total_votes}.reverse

INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 26 Dec 2014 00:48:54 UTC +00:00], ["updated_at", Fri, 26 Dec 2014 00:48:54 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save

UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = 6  [["description", "Did update work?"], ["updated_at", Sun, 28 Dec 2014 00:00:12 UTC +00:00]]
---
  def update
    if @post.update(post_params)

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 04 Jan 2015 14:46:36 UTC +00:00], ["updated_at", Sun, 04 Jan 2015 14:46:36 UTC +00:00], ["user_id", 1], ["vote", false], ["voteable_id", 9], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 6]]
---
  def set_post
    @post = Post.find(params[:id])