app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["password_digest", "$2a$10$H.MNIXoM9irhpArzlVJ0AuMo8778iBSZtz/RZ8bEON.fNwS4S38yu"], ["updated_at", Sat, 03 Jan 2015 02:10:35 UTC +00:00]]
---
  def update

    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."slug" = 'cowplow' LIMIT 1
---
  def set_user
    @user = User.find_by(slug: params[:id])