app/views/categories/index.html.erb

        <span>
          <%= link_to("#{pluralize(category.posts.size, 'post')}", category_path(category)) %>
---
SELECT COUNT(*) FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ?  [["category_id", 1]]