app/views/layouts/_navigation.html.erb

    <ul class='dropdown-menu'>
    	<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"